public/articles/elements_of_set_theory.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-12-09 Fri 14:05 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Elements of Set Theory : The Note</title>
<meta name="author" content="Ilghar Kus" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="preamble" class="status">
<p>Written by Ilghar Kus, posted on <a href="https://blog.thewizardbay.cc/">TheWizardBay</a>.</p><hr />
</div>
<div id="content" class="content">
<h1 class="title">Elements of Set Theory : The Note</h1>
<p>
This is my note during the reading
of the book <i>Elements of Set Theory</i> by <i>Herbert B. Enderton</i> .
</p>

<p>
The book is great.
</p>

<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org3ca1dc1">Chapter 1 <i>INTRODUCTION</i></a>
<ul>
<li><a href="#orgffcb500">Baby Set Theory</a></li>
<li><a href="#org4c02729">Sets - An Informal View</a></li>
<li><a href="#org291923c">Classes</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org3ca1dc1" class="outline-2">
<h2 id="org3ca1dc1">Chapter 1 <i>INTRODUCTION</i></h2>
<div class="outline-text-2" id="text-org3ca1dc1">
</div>
<div id="outline-container-orgffcb500" class="outline-3">
<h3 id="orgffcb500">Baby Set Theory</h3>
<div class="outline-text-3" id="text-orgffcb500">
<p>
In a naive approach, here is some definition.
</p>
<ul class="org-ul">
<li>A <i>set</i> is a collection of things(called its <i>members</i> or <i>elements</i>),
and the collection being regarded as a singel object.</li>
<li>\(t\in A\) means \(t\) is a member of \(A\), and \(t\notin A\) means \(t\) is not a member of \(A\).</li>
<li><p>
\(A==B\) could be translated that \(A\) has the exact same members as \(B\), in which case,
\(A\) could be \(\{2,3,5,7\}\) and \(B\) could be the set of all solutions to the equation
\(x^4-17x^3+101x^2-247x+210=0\)
</p>

<p>
to which, we say:
</p></li>
</ul>

<p>
<b>Principle of Extensionality</b> \(\quad\) If two sets have exactly the same members,
then they are equal.
</p>

<p>
In a less naive approach, we could say:
</p>

<p>
<b>Principle of Extensionality</b> \(\quad\) If \(A\) and \(B\) are sets s.t. for \(\forall t\)
\[
   t\in A \iff t\in B
   \]
then \(A=B\).
</p>

<ul class="org-ul">
<li>Empty set, noted as \(\emptyset\), has no members at all.
and it's the only set with no members.</li>

<li>\(\emptyset \in \{\emptyset\}\) and \(\emptyset \notin \emptyset\), so \(\emptyset \neq \{\emptyset\}\)</li>

<li><b>Union and Intersection</b> \(\quad\) noted respectively as \(\cup\) and \(\cap\),
means all elements of \(A\) and/or \(B\) and all elements of \(A\) and \(B\)</li>

<li>The set of all subsets of \(A\) is noted as <i>power set</i> \(\mathscr{P} A\) of \(A\),
also could be noted as \(2^{A}\)</li>

<li><i>Method of abstraction</i> \(\quad\) is a very flexible way of naming a set.
Notation used for the set of all objects \(x\) s.t. the condition P(x) holds is
\[
     \{x|P(x)\}
     \]</li>
</ul>

<p>
This method causes two disastrous paradoxes in set theory, which is
</p>
<ul class="org-ul">
<li><b>Berry's Paradox</b> \(\quad\) an expression which is self-referenced negatively</li>
<li><b>Russell's Paradox</b> \(\quad\) exemplified by \[\{x|x\notin x\}\]</li>
</ul>
</div>
</div>

<div id="outline-container-org4c02729" class="outline-3">
<h3 id="org4c02729">Sets - An Informal View</h3>
<div class="outline-text-3" id="text-org4c02729">
<p>
None of the later work will depend on this informal description.
</p>

<p>
Skip if you want.
</p>

<p>
First we gather around all the things that are not sets
but we want to have as members of our sets, call such things as atoms.
Atoms are not sets of any kind. We put all of those atoms in a set
which could be noted as \(A\), it is the first set in out description.
</p>

<p>
And now imagine a hierarchy
\[
   V_0 \subseteq V_1 \subseteq V_2 \subseteq \cdot\cdot\cdot
   \]
of sets, and we take \(V_0 = A\), the set of all atoms, and we difine
the rest of the sets recursively, for example:
\[
   V_1 = V_0 \cup \mathscr{P}V_0 = A \cup \mathscr{P}A
   \]
so, the general formula for constructing this hierarchy of sets would be:
\[
   V_{n+1} = V_n \cup \mathscr{P}V_n
   \]
Thus we obtain $V<sub>0</sub>, V<sub>1</sub>, V<sub>2</sub>,&#x2026;.$, but this infinite hierarchy
does not include enough sets. For example, the infinite set
\[
   \{\emptyset,\{\emptyset\},\{\{\emptyset\}\},...\}
   \]
but we have \(\emptyset \in V_1\),$\{ &empty; \} &isin; V<sub>2</sub> $, etc.
To remedy this lack, we contrust an infinite union
\[
   V_{\omega} = V_0\cup V_1 \cup \cdot\cdot\cdot
   \]
and then let \(V_{\omega+1} = V_{\omega} \cup \mathscr{P}V_{\omega}\),
and in general for any \(\alpha\),
\[
   V_{\alpha+1} = V_{\alpha} \cup \mathscr{P} V_{\alpha}
   \]
so we could conclude that for each set \(S\), \(\exists \alpha\) s.t. \(S \in V_{\alpha}\)
</p>

<p>
And for now, if we banish the atoms, instead take \(A=\emptyset\), and here is the ordinals.
</p>
</div>
</div>


<div id="outline-container-org291923c" class="outline-3">
<h3 id="org291923c">Classes</h3>
<div class="outline-text-3" id="text-org291923c">
<p>
There is no "set of all sets", which is later presented as a theorem, provable from the axioms.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<hr /> <p>Would like to comment? Start a discussion in <a href="https://lists.sr.ht/~ika/public-inbox">my public inbox</a> by sending an email to <a href="mailto:~ika/public-inbox@lists.sr.ht">~ika/public-inbox@lists.sr.ht</a> [<a href="https://man.sr.ht/lists.sr.ht/etiquette.md">mailing list etiquette</a>]</p>
</div>
</body>
</html>
